Tekla Open API Reference for Tekla Structures 2025
DwgObject Constructor (ViewBase, Point, String)
 Creates a new DwgObject instance with the given parameters.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DwgObject(
	ViewBase view,
	Point insertionPoint,
	string fileName
)
Public Sub New (
	view As ViewBase,
	insertionPoint As Point,
	fileName As String
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
insertionPoint
Type: Tekla.Structures.Geometry3d.Point
The insertion point to be used.
fileName
Type: System.String
The filename to be used.
Exceptions
Exception | Condition
FileNotFoundException | Thrown if the specified file does not exist.
See Also
Reference
DwgObject Class
DwgObject Overload
Tekla.Structures.Drawing Namespace